tap "aws/tap"
tap "cjbassi/ytop"
tap "harelba/q"
tap "ngrok/ngrok"
tap "normen/tap"
tap "passy/givegif"
tap "snowflakedb/snowflake-cli"
tap "withgraphite/tap"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "asdf"
brew "atuin"
brew "autojump"
brew "cryptography"
brew "aws-sam-cli"
brew "awscli"
brew "libgit2"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "bottom"
brew "freetype"
brew "fontconfig"
brew "chezmoi"
brew "cookiecutter"
brew "coreutils"
brew "diff-so-fancy"
brew "difftastic"
brew "direnv"
brew "docker-compose"
brew "harfbuzz"
brew "emscripten"
brew "eza"
brew "libavif"
brew "gd"
brew "pango"
brew "gnuplot"
brew "feedgnuplot"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "ffmpeg"
brew "flyctl"
brew "freetds"
brew "fzf"
brew "gawk"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "git-spice"
brew "git-who"
brew "glow"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gradle"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "grex"
brew "gron"
brew "gum"
brew "haproxy@2.8"
brew "helix"
brew "helm"
brew "htop"
brew "hurl"
brew "jj"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "libzip"
brew "makensis"
brew "maven"
brew "midnight-commander"
brew "mkcert"
brew "mysql-client"
brew "neofetch"
brew "neovim"
brew "netcat"
brew "nnn"
brew "nushell"
brew "nvm"
brew "onefetch"
brew "openjdk@17"
brew "ox"
brew "p7zip"
brew "php"
brew "pinentry-mac"
brew "postgresql@14"
brew "powerlevel10k"
brew "procs"
brew "pv"
brew "pyenv"
brew "pygments"
brew "python@3.10"
brew "redis"
brew "ripgrep"
brew "rustscan"
brew "rustup"
brew "sbt"
brew "scala@2.13"
brew "sd"
brew "snowflake-cli"
brew "spark"
brew "starship"
brew "step"
brew "superfile"
brew "task"
brew "tcl-tk"
brew "terminal-notifier"
brew "terraform", link: false
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "the_silver_searcher"
brew "tldr"
brew "tokei"
brew "tree"
brew "trippy"
brew "ttyplot"
brew "visidata"
brew "watchman"
brew "yazi"
brew "zellij"
brew "zk"
brew "zrok"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "cjbassi/ytop/ytop"
brew "withgraphite/tap/graphite"
cask "codex"
cask "fig"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "insomnia"
cask "localxpose"
cask "mark-text"
cask "neovide-app"
cask "ngrok"
cask "sequel-ace"
cask "stats"
cask "wezterm"
cask "zulu@17"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "aykutsarac.jsoncrack-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "felipecaputo.git-project-manager"
vscode "george-alisson.html-preview-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "ibm.output-colorizer"
vscode "k--kato.intellij-idea-keybindings"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "minifigone.archive-browser"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "mxsdev.typescript-explorer"
vscode "naumovs.color-highlight"
vscode "nhoizey.gremlins"
vscode "nickdemayo.vscode-json-editor"
vscode "openai.chatgpt"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "searking.preview-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
uv "zuban"
